[
    {
        "Title": "Apocalypse Now",
        "Year": "1979",
        "Rated": "R",
        "Released": "15 Aug 1979",
        "Runtime": "147 min",
        "Genre": "Drama, Mystery, War",
        "Director": "Francis Ford Coppola",
        "Writer": "John Milius, Francis Ford Coppola, Michael Herr (narration)",
        "Actors": "Marlon Brando, Martin Sheen, Robert Duvall, Frederic Forrest",
        "Plot": "It is the height of the war in Vietnam, and U.S. Army Captain Willard is sent by Colonel Lucas and a General to carry out a mission that, officially, 'does not exist - nor will it ever exist'. The mission: To seek out a mysterious Green Beret Colonel, Walter Kurtz, whose army has crossed the border into Cambodia and is conducting hit-and-run missions against the Viet Cong and NVA. The army believes Kurtz has gone completely insane and Willard's job is to eliminate him! Willard, sent up the Nung River on a U.S. Navy patrol boat, discovers that his target is one of the most decorated officers in the U.S. Army. His crew meets up with surfer-type Lt-Colonel Kilgore, head of a U.S Army helicopter cavalry group which eliminates a Viet Cong outpost to provide an entry point into the Nung River. After some hair-raising encounters, in which some of his crew are killed, Willard, Lance and Chef reach Colonel Kurtz's outpost, beyond the Do Lung Bridge. Now, after becoming prisoners of Kurtz, will Willard & the others be able to fulfill their mission?",
        "Language": "English, French, Vietnamese",
        "Country": "USA",
        "Awards": "Won 2 Oscars. Another 18 wins & 32 nominations.",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMDdhODg0MjYtYzBiOS00ZmI5LWEwZGYtZDEyNDU4MmQyNzFkXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_SX300.jpg",
        "Ratings": [
            {
                "Source": "Internet Movie Database",
                "Value": "8.4/10"
            },
            {
                "Source": "Rotten Tomatoes",
                "Value": "98%"
            },
            {
                "Source": "Metacritic",
                "Value": "94/100"
            },
            {
                "Source": "MYSELF",
                "Value": "10/10"
            }
        ],
        "Metascore": "94",
        "imdbRating": "8.4",
        "imdbVotes": "588,630",
        "imdbID": "tt0078788",
        "Type": "movie",
        "Response": "True",
        "Watched": true,
        "Comments": [
            {
                "TimeStamp": "2020-08-17T04:28:48.405Z",
                "Text": "Probably my favorite movie of all time."
            }
        ]
    },
    {
        "Title": "X-Men: Apocalypse",
        "Year": "2016",
        "Rated": "PG-13",
        "Released": "27 May 2016",
        "Runtime": "144 min",
        "Genre": "Action, Adventure, Sci-Fi",
        "Director": "Bryan Singer",
        "Writer": "Simon Kinberg (screenplay by), Bryan Singer (story by), Simon Kinberg (story by), Michael Dougherty (story by), Dan Harris (story by)",
        "Actors": "James McAvoy, Michael Fassbender, Jennifer Lawrence, Nicholas Hoult",
        "Plot": "Since the dawn of civilization, he was worshiped as a god. Apocalypse, the first and most powerful mutant from Marvel's X-Men universe, amassed the powers of many other mutants, becoming immortal and invincible. Upon awakening after thousands of years, he is disillusioned with the world as he finds it and recruits a team of powerful mutants, including a disheartened Magneto, to cleanse mankind and create a new world order, over which he will reign. As the fate of the Earth hangs in the balance, Raven with the help of Professor X must lead a team of young X-Men to stop their greatest nemesis and save mankind from complete destruction.",
        "Language": "English, Polish, German, Arabic, Egyptian (Ancient)",
        "Country": "USA",
        "Awards": "1 win & 19 nominations.",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMjU1ODM1MzYxN15BMl5BanBnXkFtZTgwOTA4NDE2ODE@._V1_SX300.jpg",
        "Ratings": [
            {
                "Source": "Internet Movie Database",
                "Value": "6.9/10"
            },
            {
                "Source": "Rotten Tomatoes",
                "Value": "47%"
            },
            {
                "Source": "Metacritic",
                "Value": "52/100"
            }
        ],
        "Metascore": "52",
        "imdbRating": "6.9",
        "imdbVotes": "382,834",
        "imdbID": "tt3385516",
        "Type": "movie",
        "Response": "True",
        "Watched": false,
        "Comments": []
    }
]
